[{"images":[],"skills":[],"_id":"615c3c9812d05d28fb6dea66","name":"JavaScript","short":"js","useTime":5,"experience":"Zeer Ervaren","details":"JavaScript is een taal die ik al vijf jaar gebruik en waar ik veel ervaring mee heb. De taal komt in bijna al mijn projecten terug, of het nou een website of applicatie is. Ik heb brede kennis over deze taal en verschillende frameworks gebaseerd op de taal."},{"images":[],"skills":[],"_id":"615c3c9e12d05d28fb6dfd99","name":"React","short":"react","useTime":1,"experience":"Gemiddeld","details":"React is een framework wat ik nog niet lang gebruik, maar al wel snel onder de knie had. De taal heb ik gebruikt voor deze website, maar ook voor verschillende andere applicaties."},{"images":[],"skills":[],"_id":"6165491bfaa50e4f4999e701","name":"TailwindCSS","short":"tailwindcss","useTime":1,"experience":"Gemiddeld","details":"Ik gebruik TailwindCSS pas sinds kort. Ik gebruik het voor het stylen van mijn websites, waaronder deze portfolio websites, maar ook die van klanten."},{"images":[],"skills":[],"_id":"616699cb722143d67456ece0","name":"Python","short":"python","useTime":2,"experience":"Boven Gemiddeld","details":"Python is een programmeertaal die ik regelmatig gebruik, voornamelijk voor het testen van de veiligheid van mijn applicaties en servers. Hierom heb ik hier ook verschillende tools mee geschreven."},{"images":[],"skills":[],"_id":"616699db722143d67456ece1","name":"Java","short":"java","useTime":7,"experience":"Zeer Ervaren","details":"Java is de eerste taal die ik ooit heb geleerd. Ik werk al zeven jaar met Java en heb verschillende projecten gemaakt, waaronder games en applicaties. Daarnaast gebruik ik Java als een ondersteunende taal voor mijn applicaties."},{"images":[],"skills":[],"_id":"6166ac9f722143d67456ece2","name":"NodeJS","short":"nodejs","useTime":4,"experience":"Boven Gemiddeld","details":"NodeJS gebruik ik voornamelijk voor het bouwen van mijn API applicaties voor het ophalen van data. Het is een gemakkelijke maar snelle taal voor het verwerken van alle aanvragen."},{"images":[],"skills":[],"_id":"6166acc4722143d67456ece3","name":"SQL","short":"sql","useTime":5,"experience":"Ervaren","details":"SQL is de taal die ik gebruik voor bijna al mijn database werk. Ik gebruik het voornamelijk in applicaties voor het verwerken van alle data."},{"images":[],"skills":[],"_id":"6166acd8722143d67456ece4","name":"NoSQL","short":"nosql","useTime":3,"experience":"Gemiddeld","details":"NoSQL is iets wat ik ben gaan gebruiken voor de simpliciteit van grotere data objecten, waardoor het ophalen en opslaan een stuk gemakkelijker wordt. Daarnaast gebruik ik het ook in deze website."}]